"use strict";

// Работа с рекурсией в JavaScript

// ====================================================
// №1
// Дан массив:
// let arr = [1, 2, 3, 4, 5];
// С помощью рекурсии выведите элементы этого массива в консоль.

let arr = [1, 2, 3, 4, 5];

function func() {
  
    console.log (arr.shift());
      if(arr.length != 0){
		func(arr);
     }
    } 

func(); 
//1
//2
//3
//4
//5
// ====================================================
// №2
// Дан массив:
// let arr = [1, 2, 3, 4, 5];
// С помощью рекурсии найдите сумму квадратов элементов этого массива.

let arr = [1, 2, 3, 4, 5];
function func() {
    let res = arr.shift() ** 2;
      console.log(res); // 1 4 9 16 25
      if(arr.length != 0){
        res = res + func(arr);
     }
  return res;
    } 

console.log('Cумма квадратов элементов массива' + ' = ' + func(arr)); // 55