"use strict";

// Метод map для перебора массива в JavaScript

// ====================================================
// №1
// Дан массив с числами. Используя метод map извлеките из каждого элемента массива квадратный корень и запишите результат в новый массив.

let arr = [1, 2, 3, 4, 5];

let result = arr.map(function(elem){
  return Math.sqrt(elem);
});
console.log(result); // [1, 1.4142135623730951, 1.7320508075688772, 2, 2.23606797749979]

// ====================================================
// №2
// Дан массив со строками. Используя метод map в конец значению каждого элемента массива добавьте символ '!'.

let arr = ['Yaroslav', 'Sasha', 'Denis', 'Igor', 'Vania'];

let result = arr.map(function(elem){
  return elem + '!';
});
console.log(result); // ["Yaroslav!", "Sasha!", "Denis!", "Igor!", "Vania!"]
// ====================================================
// №3
// Дан массив со строками. Используя метод map переверните символы каждой строки в обратном порядке.

let arr = ['Yaroslav', 'Sasha', 'Denis', 'Igor', 'Vania'];

    let result = arr.map(function(elem) {
        return elem.split('').reverse().join('');
        });

console.log(result); //["valsoraY", "ahsaS", "sineD", "rogI", "ainaV"]
// ====================================================
// №4
// Дан следующий массив:

// let arr = ['123', '456', '789'];
// Используя метод map преобразуйте этот массив в следующий:

// let arr = [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9]
// ];


let arr = ['123', '456', '789'];

    let result = arr.map(function(elem) {
        return elem.split('').map(Number);
        });

console.log(result); // [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

// ====================================================
// №5
// Дан массив с числами. Используя метод map запишите в каждый элемент массива значение этого элемента, умноженное на его порядковый номер в массиве.

let arr = [1, 2, 3, 4, 5];

    let result = arr.map(function(index, elem) {
        return index + String(elem) * elem-1;
        });

console.log(result); //  [0, 2, 6, 12, 20]