"use strict";

// Метод filter для фильтрации массива в JavaScript

// ====================================================
// №1
// Дан массив с числами. Оставьте в нем только положительные числа
let arr = [1, -2, 3, -4, 5];
let result = arr.filter(elem => elem > 0);

console.log(result); // [1, 3, 5]

// ====================================================
// №2
// Дан массив с числами. Оставьте в нем только отрицательные числа
let arr = [1, -2, 3, -4, 5];
let result = arr.filter(elem => elem < 0);

console.log(result); // [-2, -4]

// ====================================================
// №3
// Дан массив с числами. Оставьте в нем только числа, которые больше нуля, но меньше 10.
let arr = [1, -2, 3, -4, 5, 6, -8, 9];
let result = arr.filter(elem => elem > 0 && elem < 10);

console.log(result); // [1, 3, 5, 6, 9]

// ====================================================
// №4
// Дан массив со строками. Оставьте в нем только те строки, длина которых больше 5-ти символов.
let arr = ["Britain", "Mexika", "Afrika", "Poland", "USA"]
let result = arr.filter(elem => elem.length > 5);

console.log(result); // ["Britain", "Mexika", "Afrika", "Poland"]

// ====================================================
// №5
// Дан массив с числами. Оставьте в нем только те числа, произведение которых на их порядковый номер меньше 30.

let arr = [1, 2, 3, 4, 5, 6, 8, 90];
let result = arr.filter(function(elem, index) {
	return elem * index < 30;
});
console.log(result); // [1, 2, 3, 4, 5]

// ====================================================
// №6
// Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только обычные элементы.

let arr = [1, 2, [3, 4], 5, [6, 7]];
let result = arr.filter(function(elem, index) {
	return elem * length < 2;
});
console.log(result); // [1, 2, 5]

// ====================================================
// №7
// Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве.

let arr = [1, -2, 3, -4, 5, -6, 7];
let result = arr.filter(function(elem) {
	return elem < 0;
});
console.log(result); // [-2, -4, -6]
console.log(result.length); // 3