"use strict";

// Оператор spread и слияние массивов

// ====================================================
// №1
// Не запуская код определите, что выведется в консоль:

let arr = [...'12345'];
console.log(arr); // ["1", "2", "3", "4", "5"]

// ====================================================
// №2
// Не запуская код определите, что выведется в консоль:

let arr = ['a', ...'12345'];
console.log(arr); // ["a", "1", "2", "3", "4", "5"]

// ====================================================
// №3
// Не запуская код определите, что выведется в консоль:

let arr = [...'12345', ...'56789'];
console.log(arr); // ["1", "2", "3", "4", "5", "5", "6", "7", "8", "9"]

// ====================================================
// №4
// Не запуская код определите, что выведется в консоль:
let arr1 = ['a', 'b', 'c'];
let arr2 = [...arr1, ...'12345'];

console.log(arr2); // ["a", "b", "c", "1", "2", "3", "4", "5"]