"use strict";

// Строковое сравнение дат на JavaScript

// ====================================================
// №1 
// Напишите код, который сравнит две приведенные ниже даты и выведет сообщение о том, какая из них больше:

let date1 = '2020-11-31';
let date2 = '2020-12-01';
if(date1 > date2){
  console.log('Дата ' + date1 + ' больше даты ' + date2)
}else{
  console.log('Дата ' + date2 + ' больше даты ' + date1); //"Дата 2020-12-01 больше даты 2020-11-31"
}

// ====================================================
// №2
// Напишите код, который сравнит две приведенные ниже даты и выведет сообщение о том, какая из них больше:

let date1 = '09-21';
let date2 = '09-23';
if(date1 > date2){
  console.log('Дата ' + date2 + ' больше даты ' + date1);
}else{
  console.log('Дата ' + date1 + ' меньше ' + date2); // "Дата 09-21 меньше 09-23"
}

// ====================================================
// №3
// Дана дата, содержащая месяц и день. Определите знак Зодиака, на которую приходится эта дата. 

let str = '11-02';
let date  = new Date();
//str = addZero(date.getMonth() + 1 + '-'+ addZero(date.getDate()));
console.log(str);

function addZero(num) {
	if (num <= 9) {
		num = '0' + num;
	}
	return num;
}

if (str >= '01-20' && str <= '02-18') {
	console.log('Водолей');
}
if (str >= '02-19' && str <= '03-20') {
	console.log('Рыбы');
}
if (str >= '03-21' && str <= '04-19') {
	console.log('Овен');
}
if (str >= '04-20' && str <= '05-20') {
	console.log('Телец');
}
if (str >= '05-21' && str <= '06-21') {
	console.log('Близнецы');
}
if (str >= '06-22' && str <= '07-22') {
	console.log('Рак');
}
if (str >= '07-23' && str <= '08-22') {
	console.log('Лев');
}
if (str >= '08-23' && str <= '09-22') {
	console.log('Дева');
}
if (str >= '09-23' && str <= '10-22') {
	console.log('Весы');
}
if (str >= '10-23' && str <= '11-22') {
	console.log('Скорпион');
}
if (str >= '11-23' && str <= '12-21') {
	console.log('Стрелец');
}
if (str >= '12-22' && str <= '10-19') {
	console.log('Козерог');
} 

// "11-02"
// "Скорпион"