"use strict";

// Оператор spread в JavaScript

// ====================================================
// №1
// Дан массив:

// let arr = [1, 2, 3, 4, 5];
// Дана также функция:

// function func(num1, num2, num3, num4, num5) {
// 	return num1 + num2 + num3 + num4 + num5;
// }
// Найдите с помощью приведенной функции сумму элементов массива.

let arr = [1, 2, 3, 4, 5];

let result = function func(n1, n2, n3, n4, n5) {
	return n1 + n2 + n3 + n4 + n5;
}
console.log( result(...arr) ); // 15

// ====================================================
// №2
// Не запуская код, определите, что выведется в консоль:

function func(n1, n2, n3, n4, n5, n6, n7, n8) {
	return (n1 + n2 + n3 + n4) * (n5 + n6 + n7 + n8);
}

console.log( func(1, ...[2, 3, 4], 5, ...[6], ...[7, 8]) ); // 260

// ====================================================
// №3
// Дан массив с числами. Используя Math.min и spread выведите на экран минимальное значение массива.

let arr = [1, 2, 3, 4, 5];
let min = Math.min(...arr);
console.log(min); // 1